Documents/Договор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Договор</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Спецификация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Аксессуары</v8:Type>
								<v8:Type>cfg:CatalogRef.Продукция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикПлатежей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Договор/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаказОснованиеПриИзменении(Элемент)
    Если Объект.ЗаказОснование = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Заполняем данные из заказа-основания
    ДанныеЗаказа = ПолучитьДанныеЗаказаНаСервере(Объект.ЗаказОснование);
    
    Если ДанныеЗаказа <> Неопределено Тогда
        Объект.Клиент = ДанныеЗаказа.Клиент;
        Объект.Менеджер = ДанныеЗаказа.Менеджер;
        Объект.Продавец = ДанныеЗаказа.Менеджер;
        Объект.СуммаДоговора = ДанныеЗаказа.СуммаДокумента;
        
        // Заполняем спецификацию
        Объект.Спецификация.Очистить();
        Для Каждого СтрокаЗаказа Из ДанныеЗаказа.Спецификация Цикл
            НоваяСтрока = Объект.Спецификация.Добавить();
            НоваяСтрока.Номенклатура = СтрокаЗаказа.Номенклатура;
            НоваяСтрока.Количество = СтрокаЗаказа.Количество;
            НоваяСтрока.Цена = СтрокаЗаказа.Цена;
            НоваяСтрока.ЦенаСНДС = СтрокаЗаказа.ЦенаСНДС;
            НоваяСтрока.Сумма = СтрокаЗаказа.Сумма;
        КонецЦикла;
        
        // Пересчитываем итог с НДС
        РассчитатьИтогСНДС();
        
        // Заполняем график платежей
        ЗаполнитьГрафикПлатежейНаСервере();
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеЗаказаНаСервере(СсылкаНаЗаказ)
    ЗаказОбъект = СсылкаНаЗаказ.ПолучитьОбъект();
    
    Если ЗаказОбъект = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    РезультатСтруктура = Новый Структура;
    РезультатСтруктура.Вставить("Клиент", ЗаказОбъект.Клиент);
    РезультатСтруктура.Вставить("Менеджер", ЗаказОбъект.Менеджер);
    РезультатСтруктура.Вставить("СуммаДокумента", ЗаказОбъект.СуммаДокумента);
    
    // Собираем спецификацию
    МассивСпецификации = Новый Массив;
    Для каждого СтрокаЗаказа Из ЗаказОбъект.Спецификация Цикл
        ТекущаяСтрока = Новый Структура;
        ТекущаяСтрока.Вставить("Номенклатура", СтрокаЗаказа.Номенклатура);
        ТекущаяСтрока.Вставить("Количество", СтрокаЗаказа.Количество);
        ТекущаяСтрока.Вставить("Цена", СтрокаЗаказа.Цена);
        ТекущаяСтрока.Вставить("ЦенаСНДС", СтрокаЗаказа.ЦенаСНДС);
        ТекущаяСтрока.Вставить("Сумма", СтрокаЗаказа.Сумма);
        МассивСпецификации.Добавить(ТекущаяСтрока);
    КонецЦикла;
    
    РезультатСтруктура.Вставить("Спецификация", МассивСпецификации);
    
    Возврат РезультатСтруктура;
КонецФункции

&НаСервере
Процедура РассчитатьИтогСНДС()
    Итог = 0;
    Для каждого Строка Из Объект.Спецификация Цикл
        Итог = Итог + (Строка.Количество * Строка.ЦенаСНДС);
    КонецЦикла;
    Объект.ЦенаСНДС = Итог;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГрафикПлатежейНаСервере()
    // Очищаем старый график
    Объект.ГрафикПлатежей.Очистить();
    
    СуммаДоговора = Объект.СуммаДоговора;
    Если СуммаДоговора <= 0 Тогда
        Возврат;
    КонецЕсли;
    
    // Получаем дату договора
    ДатаДоговора = Объект.Дата;
    Если ДатаДоговора = '00010101' Тогда
        ДатаДоговора = ТекущаяДата();
    КонецЕсли;
    
    // 30% предоплата
    СуммаПредоплаты = СуммаДоговора * 0.3;
    
    // Оставшаяся сумма (70%) делится на 3 месяца
    Остаток = СуммаДоговора - СуммаПредоплаты;
    КоличествоМесяцев = 3;
    СуммаВМесяц = Остаток / КоличествоМесяцев;
    
    // 1. Предоплата (сразу)
    НоваяСтрока = Объект.ГрафикПлатежей.Добавить();
    НоваяСтрока.ДатаПлатежа = ДатаДоговора;
    НоваяСтрока.СуммаПлатежа = СуммаПредоплаты;
    
    // 2. Разбиваем остаток на 3 месяца
    Для НомерМесяца = 1 По КоличествоМесяцев Цикл
        НоваяСтрока = Объект.ГрафикПлатежей.Добавить();
        НоваяСтрока.ДатаПлатежа = ДобавитьМесяцНаСервере(ДатаДоговора, НомерМесяца);
        
        // Последний платёж — округляем, чтобы сумма сошлась
        Если НомерМесяца = КоличествоМесяцев Тогда
            НоваяСтрока.СуммаПлатежа = Остаток - (СуммаВМесяц * (КоличествоМесяцев - 1));
        Иначе
            НоваяСтрока.СуммаПлатежа = СуммаВМесяц;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ДобавитьМесяцНаСервере(ИсходнаяДата, КоличествоМесяцев)
    Год = Год(ИсходнаяДата);
    Месяц = Месяц(ИсходнаяДата) + КоличествоМесяцев;
    
    Пока Месяц > 12 Цикл
        Месяц = Месяц - 12;
        Год = Год + 1;
    КонецЦикла;
    
    День = День(ИсходнаяДата);
    
    // Корректировка дня для февраля и коротких месяцев
    Если Месяц = 2 И День > 28 Тогда
        День = 28;
    ИначеЕсли (Месяц = 4 Или Месяц = 6 Или Месяц = 9 Или Месяц = 11) И День > 30 Тогда
        День = 30;
    КонецЕсли;
    
    Возврат Дата(Год, Месяц, День);
КонецФункции

&НаКлиенте
Процедура ПечатьДоговора(Команда)
    ТабДок = ПечатьНаСервере();
    Если ТабДок <> Неопределено Тогда
        ТабДок.Показать("Печать договора");
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
    Макет = Документы.Договор.ПолучитьМакет("ПечатнаяФорма");
    Если Макет = Неопределено Тогда
        Сообщить("Макет не найден");
        Возврат Неопределено;
    КонецЕсли;
    
    ТабДок = Новый ТабличныйДокумент;
    
    // Шапка
    ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
    ОбластьШапка.Параметры.Номер = Объект.Номер;
    ОбластьШапка.Параметры.Дата = Формат(Объект.Дата, "ДЛФ=DD.MM.YYYY");
    ОбластьШапка.Параметры.Клиент = Объект.Клиент;
    ТабДок.Вывести(ОбластьШапка);
    
    // Спецификация
    ОбластьСпецификация = Макет.ПолучитьОбласть("Спецификация");
    Для каждого Строка Из Объект.Спецификация Цикл
        ОбластьСпецификация.Параметры.Номенклатура = Строка.Номенклатура;
        ОбластьСпецификация.Параметры.Количество = Строка.Количество;
        ОбластьСпецификация.Параметры.Цена = Строка.Цена;
        ОбластьСпецификация.Параметры.Сумма = Строка.Сумма;
        ТабДок.Вывести(ОбластьСпецификация);
    КонецЦикла;
    
    // Итого
    ОбластьИтого = Макет.ПолучитьОбласть("Итого");
    ОбластьИтого.Параметры.Итого = Объект.СуммаДоговора;
    ТабДок.Вывести(ОбластьИтого);
    
    // Подписи
    ОбластьПодписи = Макет.ПолучитьОбласть("Подписи");
    ОбластьПодписи.Параметры.Покупатель = Объект.Клиент;
    ОбластьПодписи.Параметры.Продавец = Объект.Продавец;
    ТабДок.Вывести(ОбластьПодписи);
    
    Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
    ЗаполнитьГрафикПлатежейНаСервере();
    Сообщить("График платежей заполнен");
КонецПроцедуры
